---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.PipingSystem.SystemType
source: html/b667a00d-e76c-240c-99b0-354fd0eb12fc.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.SystemType Property

The type of this piping system.

## Syntax (C#)
```csharp
public PipeSystemType SystemType { get; }
```